[
  {
    "u": "$76,000 granted to Tofino and Ucluelet Community Salmon projects",
    "c": "The Pacific Salmon Foundation (PSF) provided grants this year to four projects in the Ucluelet and Tofino area totaling $76,590 through the PSF Community Salmon Program (CSP). The total value of the projects, which includes community fundraising, contributions and volunteer time, is $1,022,460, and is focused on habitat rehabilitation and stock assessment. Cedar Coast Field Station Society: Juvenile salmon assessments in Clayoquot Sound; Central Westcoast Forest Society: Habitat Restoration at Shuhum Creek & Hydro Hill Watershed Projects; Thornton Creek Enhancement Society: Juvenile Chinook Survival and Hatchery Release Strategy Project. Community volunteers planting the banks of Hydro Hill West Creek with native vegetation and log placements to provide shade and cover for Pacific salmon habitat, Ucluelet spring 2019, photo credit Rob Crenson. \"The work completed on the Hydro Hill Watershed could not have been successful without the support from Pacific Salmon Foundation. It has been incredibly uplifting to see visible improvements to habitat conditions for Coho and cutthroat trout in this creek. PSF continues to be one of the most dedicated salmon stewardship organizations in Canada,\" Megan Francis, General Manager, Central Westcoast Forest Society. These are important projects, and we know that Pacific salmon need our help now to restore spawning habitats in streams and rivers and carry out stock assessment,” says Michael Meneer, Pacific Salmon Foundation President and CEO. \"The Community Salmon Program values its partnerships with grassroot organizations like the Cedar Coast Field Station Society, the Central Westcoast Forest Society and the Thornton Creek Enhancement Society, along with all of our partners in communities across the province.\""
  },
  {
    "u": "$56,900 granted to Powell River Community Salmon projects",
    "c":"The Pacific Salmon Foundation (PSF) announces grants for two projects in the Powell River area totaling $56,900 through the PSF Community Salmon Program (CSP). The total value of the projects, which includes community fundraising, contributions and volunteer time, is $567,675 and is focused on stewardship, education and outreach in the Powell River area. Powell River Salmon Society, Lang Creek Stock Enhancement - Supplies, materials, operation costs to support staff and volunteers to capture, incubate, rear and release Chinook, Chum, and Coho, and also support salmon education through Salmon in the Classroom activities. Tla'amin Nation, Tla'amin Nation Salmon Hatchery - Equipment Upgrades replacing existing wooden raceway, catwalks, stop logs, and juvenile pond screens with repurposed and updated and fish safe equipment. \"This project is a worthwhile collaboration between PSF, Tla’amin Nation and DFO which will provide benefits to both the enhancement of Pacific salmon at Tla'amin Salmon Hatchery, but will also help to improve safety of hatchery staff as well. The expected outcomes include improved fish health and survival of 170,000 Chinook, 60,000 adipose clipped Coho, and 1.4 million Chum salmon, the improved health & safety of six hatchery staff, and provide increased hatchery capacity allowing flexibility of hatchery activities and operations,\" Laura Terry, Community Advisor, DFO Salmon Enhancement Program. \"Our important stock enhancement work would not be possible without the support of the Pacific Salmon Foundation,\" Shane Dobler, Hatchery Manager, Powell River Salmon Society.  This grant will support 150 volunteers to capture, incubate, rear and release 850,000 Chinook, 500,000 Chum and 300,000 Coho for commercial, recreational and Indigenous fisheries. \"Supporting community salmon projects across the province is crucial at this time. The Community Salmon Program values its partnerships and the good work of First Nations and organizations such as the Tla'amin Nation, the Powell River Salmon Society, and the Department of Fisheries and Oceans. By working together, we can find solutions to ensure the future of Pacific salmon across the province,\" says Michael Meneer, Pacific Salmon Foundation President and CEO."
  },
  {
    "u": "$24,000 granted to Oceanside Community Salmon projects",
    "c": "The Pacific Salmon Foundation (PSF) announces grants for four projects in the Oceanside area totaling $24,665 through the PSF Community Salmon Program (CSP). The total value of the projects, which includes community fundraising, contributions and volunteer time, is $137,359 and is focused on habitat rehabilitation, education, outreach and stock enhancement in the Oceanside area. Guardians of Mid Island Estuaries Society, Eco-Cultural Estuary Restoration; Mid Vancouver Island Habitat Enhancement Society, Stream Crossing Yellow Fish Signs for the Englishman Watershed; Parksville Fish & Game Association, Marion Baker Hatchery Water Quality Improvement; Nile Creek Enhancement Society, Hatchery Upgrades. \"Eco-cultural restoration of sedge marsh habitat was initially developed in partnership with the K'omoks and Wei Wai Kum First Nations. We have now transitioned to building habitat exclosures that resemble Indigenous fish weirs for a modern purpose, to protect and enhance salmon habitat,\" said Tim Clermont, Executive Director with The Guardians of Mid Island Estuaries Society. \"Our volunteer-based society conducted research in 2010 on the Little Qualicum and Englishman River estuaries to build fenced exclosures to stop locally over-abundant Canada Goose herbivory and degradation of Carex sedge marsh habitat, which is critical for salmon juveniles and a sign of a healthy productive estuary. Thanks to the Pacific Salmon Foundation, the City of Parksville, Sna-Naw-As First Nation, and the Regional District of Nanaimo we have managed the local goose population and restored over 5,000 m2 of prime sedge marsh habitat at these Oceanside estuaries. Support from the Pacific Salmon Foundation has provided us with funds to develop our hatchery and replace collapsing culverts. This year the PSF grant will upgrade our six tanks and provide a water delivery upgrade to the tanks, giving better distribution and less silt. Without the generous help from Pacific Salmon Foundation it would be a struggle to complete these projects,\" Jack Gillen, President Nile Creek Enhancement Society. \"These are great projects for Pacific salmon, and we know that Pacific salmon need our help now to restore spawning habitats in stream and rivers, carry out stock assessment and enhancement, and provide educational opportunities,\" says Michael Meneer, Pacific Salmon Foundation President and CEO. “The Community Salmon Program values its partnerships with grassroot organizations like the Guardians of Mid Island Estuaries Society, the Parksville Fish & Game Association, the Mid Vancouver Island Habitat, the Nile Creek Enhancement Society and all of our partners in communities across the province.\""
  },
  {
    "u": "$29,000 granted by Pacific Salmon Foundation for \"Heart of the Fraser\" Study",
    "c": "The Pacific Salmon Foundation (PSF) announced a $29,250 grant to identify critical Pacific salmon habit meriting protection in the Fraser River. The Outdoor Recreation Council of BC received the grant from the PSF Community Salmon Program (CSP). The total value of the project, which includes community fundraising, in-kind contributions and volunteer time, is $70,450, focused on key Pacific salmon habitats in the Fraser River. \"Support from the PSF for our Fraser River juvenile salmon study will enable us to gather key information that will be crucial to efforts to better manage and protect the Heart of the Fraser, one of the most productive stretches of river on Earth for wild salmon,\" Mark Angelo, Outdoor Recreation Council Rivers Chair. \"This project will document seasonal use of flooded islands by juvenile salmonids within the Fraser River floodplain, with a particular focus on use by upper and mid Fraser juvenile Chinook Salmon.\" \"The Pacific Salmon Foundation is keen to support the crucial habitat assessment and data collection work done by the organizers and volunteers that bring projects like this to life. We are grateful to Mark Angelo and the Outdoor Recreation Council of BC who will be celebrating the 40th anniversary of BC Rivers Day this year, an event that inspired the creation of World Rivers Day,\" says Michael Meneer, Pacific Salmon Foundation President and CEO. \"By working together with community organizations, government, First Nations, businesses, and volunteers, we can find solutions together and the best way to ensure the future of Pacific salmon across the province.\" Set for September 27th 2020, BC Rivers Day and World Rivers Day will host a variety of events, both physical and virtual, around the globe in preparation for the world’s largest celebration of rivers and the many lifeforms they sustain."
  },
  {
    "u": "$162,000 granted to 12 Central and North Coast Salmon Community projects",
    "c": "The Pacific Salmon Foundation (PSF) announces grants for 12 projects along the North and Central Coast with a total of $162,567 in grants awarded through the Community Salmon Program (CSP). The total value of the projects, which includes community fundraising, contributions and volunteer time, is $1,736,041. Funding from PSF will be used to purchase water temperature data loggers; identify restoration priorities in the Lower Skeena watershed; clear salmon passage obstructions near Smithers; carry out habitat rehabilitation, stock assessment, and expand education and outreach opportunities in communities. Central and North Coast Community Salmon Program projects: Bella Bella, Heiltsuk Integrated Resource Management Department, Stock Assessment; Bella Coola, Nuxalk Nation, Stock Assessment; Burns Lake, Lake Babine Nation, Education and Outreach; Hazleton, Gitksan Watershed Authorities, Habitat Rehabilitation; Houston, Rocha Canada, Education and Outreach; Kitwanga, Gitanyow Fisheries Authority, Stock Assessment; Klemtu, Kitasoo/Xai'xais Stewardship Authority, two Stock Assessment projects; Prince Rupert, North Coast Skeena First Nations Stewardship Society, Habitat Assessment & Prince Rupert Salmonid Enhancement Society, Education and Outreach; Smithers, Bulkley Valley Rod and Gun Club, Habitat Rehabilitation; Terrace, Lakelse Watershed Stewards Society, Stock Assessment. \"Support from PSF’s Community Salmon Program has been essential for the success of our current and past projects. Funding has allowed us to construct an additional rock weir at Kleanza Creek to improve spawning habitat for Pacific salmon, which increased the area of habitat restored, and collect important water temperature data throughout the Kitsumkalum watershed to support our habitat restoration program. NCSFNSS looks forward to working with PSF in the future to continue to improve salmon habitat in the Lower Skeena watershed.\" Robin Brand Fish Habitat Restoration Biologist, North Coast-Skeena First Nations Stewardship Society, Prince Rupert BC. \"The salmon research program out on the Koeye River has been providing us with much needed data on the size and health of our salmon populations at Koeye, especially Sockeye and Coho, which we use to inform our local management strategies within the Heiltsuk Nation’s territory. The new camera system being installed on the Koeye weir will be especially valuable as it will allow us to monitor all of the river’s salmon populations in real time so that strategies can be actively adapted to benefit both our people and our salmon. The funding we receive from PSF and the Community Salmon Program has been crucial in the implementation of the new camera system as well as keeping our staff well trained and equipped to perform their work safely and effectively,\" William Housty, Chair, Board of Directors, Heiltsuk Integrated Resource Management Department (HIRMD). \"PSF is proud to support organizations such as the North Coast-Skeena First Nations Stewardship Society and the Heiltsuk Integrated Resource Management Department on these important projects as they are key to finding solutions for the future of Pacific salmon across British Columbia,\" says Michael Meneer, PSF President and CEO. \"We know that Pacific salmon need our help now more than ever to restore spawning habitats, provide educational opportunities, and carry out stock assessment. Working with First Nations, government, businesses, community organizations and volunteers, we can find solutions together.\""
  }
]
